#	create_clock -period 10.000 -waveform {0.000 5.000} -name clkin [get_ports clk]

## inputs_delays    
#    set_input_delay -clock clkin 0.150 [get_ports reset]
    
#    set_input_delay -clock clkin 0.150 [get_ports en_mem]
    
#    set_input_delay -clock clkin 0.150 [get_ports start]
    
#    set_input_delay -clock clkin 0.150 [get_ports addra[0]]

#    set_input_delay -clock clkin 0.150 [get_ports addra[1]]

#    set_input_delay -clock clkin 0.150 [get_ports addra[2]]

#    set_input_delay -clock clkin 0.150 [get_ports addra[3]]

#    set_input_delay -clock clkin 0.150 [get_ports addra[4]]

#    set_input_delay -clock clkin 0.150 [get_ports addra[5]]
#    set_input_delay -clock clkin -min 0.250 [get_ports addra[5]]

#    set_input_delay -clock clkin 0.150 [get_ports addra[6]]

#    set_input_delay -clock clkin 0.150 [get_ports sw_out]

## out_delays
#    set_output_delay -clock clkin 0.010 [get_ports led[0]]
        
#    set_output_delay -clock clkin 0.010 [get_ports led[1]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[2]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[3]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[4]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[5]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[6]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[7]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[8]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[9]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[10]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[11]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[12]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[13]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[14]]
    
#    set_output_delay -clock clkin 0.010 [get_ports led[15]]
    
    